let text = prompt("Для початку введіть рік народження")
let year = new Date().getFullYear();
let age = year - text;
console.log(`Вам ${age}`);
alert(`УВАГА! Всі відповіді треба писати з великої бувки`)
let answerl = prompt("О тож готові почати вікторину?");
if (answerl == `Ні`){
    alert(`Добре, розпочнем наступного разу.`)
} else {
    let answer2= prompt(`Сонце це зірка?`)
    if (answer2 == `Ні`){
        alert(`Со́нце — зоря, що є центром Сонячної системи.`)
    }  else {
        let answer3= prompt(`Україна є центром європи?`)
        if (answer3 == `Ні`){
            alert(`Навіть географічний центр Європи – у нас! І це не жарт. Він насправді знаходиться на території найвисокогірнішого району України – Рахівського, Закарпатської області, неподалік села Ділове.`)
        }else {
            let answer4= prompt(`В Україні 26 областей?`)
            if (answer4 == `Так`){
                alert(`Ні їх 25 (і це не обговорюється)`)
            }
        }      
    }
}
alert(`Молодець ти відповів правильно`)
